# TextSize Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TableCellStyle..::..TextSize Property
TableCellStyle Class See Also
---
The text size.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public double TextSize { get; set; }
```

Visual Basic
---
```text
Public Property TextSize As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double TextSize {
	double get ();
	void set (double value);
}
```

# See Also
TableCellStyle Class
Autodesk.Revit.DB Namespace